In [4]:
# importing relevant libraries
import pandas as pd
import numpy as np

In [ ]:
#Open Lecture 2 Dataframe, print df and head
df=pd.read_csv('lecture2data.csv')
df

,PassengerId,Survived,Class,Name,Sex,Age,Ticket,Fare,Cabin,Port
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,NaN,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,NaN,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.750,NaN,Q

In [7]:
#Look at columns in Dataframe

In [6]:
#Look at certain column

In [ ]:
# Filtering
# Access a group of rows and columns by label(s) or a boolean array.
FareAbove20_YoungerThan40=...

In [ ]:
#Find mean of a column

In [ ]:
#Fillna

In [ ]:
#Dummy Encoding 
df['male']=0
df['female']=0
df

In [ ]:
#Fill in dummy columns!

# not recommended!

In [ ]:
# better way!